TheMalkavien/MeshCore/src/helpers/nrf52/NRF52OTA.cpp
#if defined(NRF52_PLATFORM) && defined(MESH_LORA_OTA)

#include "NRF52OTA.h"

#include "NRF52OTAApply.h"
#include "NRF52OTAInflate.h"
#include "NRF52OTALayout.h"
#include "NRF52OTAMD5.h"

#include <Arduino.h>
#include <ctype.h>
#include <stdlib.h>
#include <string.h>

// Declared here rather than through <flash/flash_nrf5x.h> so this file does not
// depend on the framework library's include path being exported. Both are
// SoftDevice-aware: with BLE up they go through sd_flash_*, otherwise straight
// to the NVMC.
extern "C" {
  int  flash_nrf5x_write(uint32_t dst, void const *src, uint32_t len);
  void flash_nrf5x_flush(void);
  bool flash_nrf5x_erase(uint32_t addr);
}

#define OTA_CMD_MAX_CHUNK_BYTES  160
#define OTA_PROGRESS_LOG_STEP_BYTES 4096

// A session that stays armed/active with no OTA traffic (client gone, lost
// abort packet) would otherwise hold the OTA state forever. After this idle
// window the session is safely discarded on the next OTA command.
#ifndef NRF52_OTA_SESSION_TIMEOUT_MS
  #define NRF52_OTA_SESSION_TIMEOUT_MS (5UL * 60UL * 1000UL)
#endif

// A successful 'end' leaves the image staged but the node still has to reset to
// run it, and the client's reboot command is a plain fire-and-forget packet.
#ifndef NRF52_OTA_REBOOT_GRACE_MS
  #define NRF52_OTA_REBOOT_GRACE_MS (60UL * 1000UL)
#endif

// RAM staging buffer: chunks accumulate here and hit the flash only once per
// buffer-full. One flash page per flush is deliberate - an nRF52 page erase
// stalls every flash access, interrupt vectors included, for tens of ms, so a
// bigger block would blind the radio for that much longer in one go. The active
// block size is advertised in the 'start ota' reply as 'blk=' so the client
// aligns its checkpoints on it.
#ifndef NRF52_OTA_STAGE_BUFFER_BYTES
  #define NRF52_OTA_STAGE_BUFFER_BYTES NRF52_OTA_PAGE_SIZE
#endif

#ifndef NRF52_OTA_SERIAL_DEBUG
  #define NRF52_OTA_SERIAL_DEBUG 1
#endif

#if NRF52_OTA_SERIAL_DEBUG
  #define OTA_DEBUG_PRINTLN(F, ...) Serial.printf("[OTA] " F "\n", ##__VA_ARGS__)
#else
  #define OTA_DEBUG_PRINTLN(...)
#endif

NRF52OTAController::NRF52OTAController() {
  _stage = NULL;
  _stage_size = 0;
  _stage_base = 0;
  _stage_range_count = 0;
  _md5_ctx = NULL;
  clearState();
}

void NRF52OTAController::clearState() {
  _armed = false;
  _active = false;
  _awaiting_reboot_since = 0;
  _stream_started = false;
  _md5[0] = 0;
  _expected_size = 0;
  _received_size = 0;
  _flashed_size = 0;
  _next_progress_log = 0;
  _ack_every_chunks = 1;
  _chunks_since_ack = 0;
  _last_activity_millis = millis();
  if (_stage) {
    free(_stage);
    _stage = NULL;
  }
  _stage_size = 0;
  _stage_base = 0;
  _stage_range_count = 0;
  if (_md5_ctx) {
    free(_md5_ctx);
    _md5_ctx = NULL;
  }
}

// Size of the staging block currently being received (the last block of the
// transfer can be shorter than the buffer).
size_t NRF52OTAController::stageExtent() const {
  if (_stage_size == 0 || _expected_size <= _stage_base) return 0;
  size_t left = _expected_size - _stage_base;
  return left < _stage_size ? left : _stage_size;
}

// Contiguous bytes received from the start of the current block.
size_t NRF52OTAController::stagePrefix() const {
  if (_stage_range_count == 0 || _stage_ranges[0].start != 0) return 0;
  return _stage_ranges[0].end;
}

// Insert [start,end) into the sorted disjoint range set, merging overlapping
// and adjacent segments. Returns false only when a brand-new hole-bounded
// segment would overflow the table (the caller then degrades to
// sequential-only acceptance; strictly in-order streams always merge into
// ranges[0] and cannot fail).
bool NRF52OTAController::insertStageRange(size_t start, size_t end) {
  int i = 0;
  while (i < _stage_range_count && _stage_ranges[i].end < start) {
    i++;
  }

  if (i == _stage_range_count || _stage_ranges[i].start > end) {
    if (_stage_range_count >= MAX_STAGE_RANGES) return false;
    memmove(&_stage_ranges[i + 1], &_stage_ranges[i],
            (_stage_range_count - i) * sizeof(StageRange));
    _stage_ranges[i].start = (uint16_t) start;
    _stage_ranges[i].end = (uint16_t) end;
    _stage_range_count++;
    return true;
  }

  if (start < _stage_ranges[i].start) _stage_ranges[i].start = (uint16_t) start;
  if (end > _stage_ranges[i].end) _stage_ranges[i].end = (uint16_t) end;

  int j = i + 1;
  while (j < _stage_range_count && _stage_ranges[j].start <= _stage_ranges[i].end) {
    if (_stage_ranges[j].end > _stage_ranges[i].end) {
      _stage_ranges[i].end = _stage_ranges[j].end;
    }
    j++;
  }
  if (j > i + 1) {
    memmove(&_stage_ranges[i + 1], &_stage_ranges[j],
            (_stage_range_count - j) * sizeof(StageRange));
    _stage_range_count -= (uint8_t)(j - i - 1);
  }
  return true;
}

// Append ' miss=<abs>+<len>,...' for the holes BETWEEN received segments of
// the current block (the tail past the last segment is data the client simply
// hasn't sent yet, not a loss).
void NRF52OTAController::appendMissList(char reply[], size_t max_len) const {
  if (_stage_range_count == 0) return;

  size_t len = strlen(reply);
  int added = 0;
  size_t hole_start = 0;  // block-relative
  for (int k = 0; k <= _stage_range_count - 1; k++) {
    if (_stage_ranges[k].start > hole_start) {
      char item[32];
      snprintf(item, sizeof(item), "%s%lu+%lu",
               added == 0 ? " miss=" : ",",
               (unsigned long)(_stage_base + hole_start),
               (unsigned long)(_stage_ranges[k].start - hole_start));
      size_t item_len = strlen(item);
      if (len + item_len >= max_len) break;
      strcpy(reply + len, item);
      len += item_len;
      added++;
      if (added >= 8) break;
    }
    hole_start = _stage_ranges[k].end;
  }
}

size_t NRF52OTAController::flushBlockBytes() const {
  return _stage_size > 0 ? _stage_size : NRF52_OTA_PAGE_SIZE;
}

bool NRF52OTAController::isSleepInhibited() const {
  if (_awaiting_reboot_since != 0
      && (uint32_t)(millis() - _awaiting_reboot_since) < NRF52_OTA_REBOOT_GRACE_MS) {
    return true;
  }
  return (_armed || _active) && !sessionExpired();
}

