TheMalkavien/MeshCore/src/helpers/nrf52/NRF52OTA.cpp
bool NRF52OTAController::sessionExpired() const {
  if (!_armed && !_active) return false;
  return (uint32_t)(millis() - _last_activity_millis) > NRF52_OTA_SESSION_TIMEOUT_MS;
}

void NRF52OTAController::expireIfIdle() {
  if (!sessionExpired()) return;
  OTA_DEBUG_PRINTLN("session idle > %lu ms, auto-abort", (unsigned long) NRF52_OTA_SESSION_TIMEOUT_MS);
  abortUpdate();
  clearState();
}

// Nothing to undo in flash: an aborted transfer just leaves bytes in the
// staging area, which the next 'begin' overwrites. What must not survive is an
// armed record, and 'begin' clears that before the first byte lands.
void NRF52OTAController::abortUpdate() {
  flash_nrf5x_flush();
}

const char *NRF52OTAController::skipSpaces(const char *p) {
  while (*p == ' ') {
    p++;
  }
  return p;
}

bool NRF52OTAController::isValidHexChar(char c) {
  return (c >= '0' && c <= '9') ||
         (c >= 'a' && c <= 'f') ||
         (c >= 'A' && c <= 'F');
}

bool NRF52OTAController::decodeHex(const char *hex, size_t hex_len, uint8_t *out, size_t max_out, size_t *out_len) {
  if ((hex_len & 1) != 0) return false;
  size_t bytes = hex_len / 2;
  if (bytes > max_out) return false;

  for (size_t i = 0; i < bytes; i++) {
    char hi = hex[i * 2];
    char lo = hex[i * 2 + 1];
    if (!isValidHexChar(hi) || !isValidHexChar(lo)) {
      return false;
    }

    uint8_t hv = (uint8_t)(isdigit((unsigned char)hi) ? (hi - '0') : (tolower((unsigned char)hi) - 'a' + 10));
    uint8_t lv = (uint8_t)(isdigit((unsigned char)lo) ? (lo - '0') : (tolower((unsigned char)lo) - 'a' + 10));
    out[i] = (uint8_t)((hv << 4) | lv);
  }

  *out_len = bytes;
  return true;
}

static void bytesToHex(const uint8_t *src, size_t len, char *dst) {
  static const char kHex[] = "0123456789abcdef";
  for (size_t i = 0; i < len; i++) {
    dst[i * 2] = kHex[(src[i] >> 4) & 0x0F];
    dst[i * 2 + 1] = kHex[src[i] & 0x0F];
  }
  dst[len * 2] = 0;
}

bool NRF52OTAController::startSession(const char *id, char reply[]) {
  OTA_DEBUG_PRINTLN("start requested by %s", id ? id : "?");
  expireIfIdle();

  if (_active) {
    strcpy(reply, "Err - OTA already running");
    OTA_DEBUG_PRINTLN("rejected: OTA already running");
    return true;
  }

  clearState();
  _armed = true;
  _last_activity_millis = millis();

  _stage = (uint8_t *) malloc(NRF52_OTA_STAGE_BUFFER_BYTES);
  _stage_size = _stage ? NRF52_OTA_STAGE_BUFFER_BYTES : 0;
  _stage_base = 0;
  _stage_range_count = 0;
  if (_stage_size == 0) {
    OTA_DEBUG_PRINTLN("stage buffer alloc failed, falling back to unbuffered writes");
  }

  uint32_t free_kb = nrf52OtaStageSize() / 1024UL;
  // gz=1 means 'send me a gzip stream'. Unlike the ESP32 it is not optional
  // here: a raw image does not fit alongside the running firmware.
  sprintf(reply, "OK - OTA ready (%lukB free, blk=%u, gz=1, nack=miss)",
          (unsigned long) free_kb, (unsigned int) flushBlockBytes());
  OTA_DEBUG_PRINTLN("session armed, stage=%lu kB, blk=%u",
                    (unsigned long) free_kb, (unsigned int) flushBlockBytes());
  return true;
}

// Everything received is verified, then recorded so the applier picks it up at
// the next boot. This is where an update actually becomes pending.
bool NRF52OTAController::armRecord(char reply[]) {
  flash_nrf5x_flush();

  const uint8_t *stream = (const uint8_t *) nrf52OtaStageStart();

  if (_md5[0]) {
    uint8_t digest[16];
    char got[33];
    ota_md5_final((ota_md5_ctx *) _md5_ctx, digest);
    bytesToHex(digest, 16, got);
    if (strcasecmp(got, _md5) != 0) {
      OTA_DEBUG_PRINTLN("end failed: MD5 mismatch (%s != %s)", got, _md5);
      strcpy(reply, "Err - MD5 mismatch");
      return false;
    }
  }

  uint32_t isize = 0;
  if (ota_inflate_gzip_isize(stream, _flashed_size, &isize) != OTA_INFLATE_OK) {
    OTA_DEBUG_PRINTLN("end failed: not a gzip stream");
    strcpy(reply, "Err - not a gzip stream");
    return false;
  }
  if (isize == 0 || isize > nrf52OtaAppSize()) {
    OTA_DEBUG_PRINTLN("end failed: image %lu > app region %lu",
                      (unsigned long) isize, (unsigned long) nrf52OtaAppSize());
    sprintf(reply, "Err - image too big (%lu > %lu)",
            (unsigned long) isize, (unsigned long) nrf52OtaAppSize());
    return false;
  }

  NRF52OTARecord rec;
  memset(&rec, 0, sizeof(rec));
  rec.magic = NRF52_OTA_RECORD_MAGIC;
  rec.stream_len = (uint32_t) _flashed_size;
  rec.image_size = isize;
  if (_md5[0]) {
    size_t n = 0;
    decodeHex(_md5, 32, rec.md5, sizeof(rec.md5), &n);
    rec.flags |= NRF52_OTA_FLAG_HAS_MD5;
  }
  rec.check = nrf52OtaRecordCheck(&rec);

  // Decompress the whole thing before arming anything. Several seconds of CPU,
  // and worth every one of them: it is the difference between a bad image
  // being reported here and being discovered halfway through erasing the app.
  OTA_DEBUG_PRINTLN("verifying image (%lu -> %lu bytes), this takes a moment",
                    (unsigned long) _flashed_size, (unsigned long) isize);

  // The record has to be readable by the dry run, which reads it from flash.
  flash_nrf5x_erase(nrf52OtaRecordPage());
  if (flash_nrf5x_write(nrf52OtaRecordPage(), &rec, sizeof(rec)) < 0) {
    OTA_DEBUG_PRINTLN("end failed: cannot write the OTA record");
    strcpy(reply, "Err - record write failed");
    return false;
  }
  flash_nrf5x_flush();

  char cause[48];
  if (!nrf52OtaDryRun(cause, sizeof(cause))) {
    OTA_DEBUG_PRINTLN("end failed: %s", cause);
    flash_nrf5x_erase(nrf52OtaRecordPage());   // disarm, keep running the old firmware
    snprintf(reply, 96, "Err - %s", cause);
    return false;
  }

  OTA_DEBUG_PRINTLN("image verified and armed, %lu -> %lu bytes",
                    (unsigned long) _flashed_size, (unsigned long) isize);
  return true;
}

bool NRF52OTAController::handleCommand(const char *command, char reply[]) {
  expireIfIdle();
  if (_armed || _active) {
    _last_activity_millis = millis();
  }
  const char *sub = skipSpaces(command);

  if (*sub == 0 || strcmp(sub, "help") == 0) {
    strcpy(reply, "OTA: begin/write/end/status/abort/dryrun");
    return true;
  }

  if (strncmp(sub, "status", 6) == 0 && (sub[6] == 0 || sub[6] == ' ')) {
    if (_active) {
      sprintf(reply, "OTA active %lu/%lu nack=miss blk=%u",
              (unsigned long) _received_size, (unsigned long) _expected_size,
              (unsigned int) flushBlockBytes());
      appendMissList(reply, 140);
    } else if (_awaiting_reboot_since != 0) {
      strcpy(reply, "OTA staged, reboot now");
    } else if (_armed) {
      strcpy(reply, "OTA armed");
    } else if (nrf52OtaLastApplyResult()[0]) {
      snprintf(reply, 140, "OTA idle (last apply %s)", nrf52OtaLastApplyResult());
    } else {
      strcpy(reply, "OTA idle");
    }
    return true;
  }

  if (strncmp(sub, "dryrun", 6) == 0 && (sub[6] == 0 || sub[6] == ' ')) {
    char cause[48];
    bool ok = nrf52OtaDryRun(cause, sizeof(cause));
    snprintf(reply, 140, "%s - dryrun %s", ok ? "OK" : "Err", cause);
    return true;
  }

  if (strncmp(sub, "abort", 5) == 0 && (sub[5] == 0 || sub[5] == ' ')) {
    abortUpdate();
    flash_nrf5x_erase(nrf52OtaRecordPage());
    clearState();
    OTA_DEBUG_PRINTLN("aborted");
    strcpy(reply, "OK - OTA aborted");
    return true;
  }

  if (strncmp(sub, "begin", 5) == 0 && (sub[5] == 0 || sub[5] == ' ')) {
    if (!_armed) {
      OTA_DEBUG_PRINTLN("begin rejected: not armed");
      strcpy(reply, "Err - run 'start ota' first");
      return true;
    }
    if (_active) {
      OTA_DEBUG_PRINTLN("begin rejected: OTA already running");
      strcpy(reply, "Err - OTA already running");
      return true;
    }

    sub = skipSpaces(sub + 5);
    if (*sub == 0) {
      strcpy(reply, "Err - ota begin <size> [md5] [ack_every]");
      return true;
    }

    char *endptr = nullptr;
    unsigned long size_ul = strtoul(sub, &endptr, 10);
    if (endptr == sub || size_ul == 0) {
      OTA_DEBUG_PRINTLN("begin rejected: bad size");
      strcpy(reply, "Err - bad OTA size");
      return true;
    }
    sub = skipSpaces(endptr);

    bool has_md5 = false;
    uint16_t ack_every = 1;
    char md5[33];
    memset(md5, 0, sizeof(md5));
    if (*sub != 0) {
      const char *tok1 = sub;
      const char *tok1_end = tok1;
      while (*tok1_end && *tok1_end != ' ') {
        tok1_end++;
      }
      size_t tok1_len = (size_t)(tok1_end - tok1);

