TheMalkavien/MeshCore/src/helpers/nrf52/NRF52OTA.cpp
      bool tok1_is_md5 = (tok1_len == 32);
      if (tok1_is_md5) {
        for (size_t i = 0; i < tok1_len; i++) {
          if (!isValidHexChar(tok1[i])) {
            tok1_is_md5 = false;
            break;
          }
        }
      }

      if (tok1_is_md5) {
        memcpy(md5, tok1, 32);
        has_md5 = true;
        sub = skipSpaces(tok1_end);
      } else {
        char *ack_end = nullptr;
        unsigned long ack_ul = strtoul(tok1, &ack_end, 10);
        if (ack_end == tok1 || ack_end != tok1_end) {
          if (tok1_len == 32) {
            OTA_DEBUG_PRINTLN("begin rejected: bad md5 value");
            strcpy(reply, "Err - bad MD5 value");
          } else {
            OTA_DEBUG_PRINTLN("begin rejected: bad ack_every token");
            strcpy(reply, "Err - bad ack_every");
          }
          return true;
        }
        if (ack_ul < 1 || ack_ul > 64) {
          OTA_DEBUG_PRINTLN("begin rejected: bad ack_every %lu", ack_ul);
          strcpy(reply, "Err - ack_every range 1..64");
          return true;
        }
        ack_every = (uint16_t) ack_ul;
        sub = skipSpaces(tok1_end);
      }

      if (*sub != 0) {
        const char *tok2 = sub;
        const char *tok2_end = tok2;
        while (*tok2_end && *tok2_end != ' ') {
          tok2_end++;
        }
        char *ack_end = nullptr;
        unsigned long ack_ul = strtoul(tok2, &ack_end, 10);
        if (ack_end == tok2 || ack_end != tok2_end) {
          OTA_DEBUG_PRINTLN("begin rejected: bad ack_every token");
          strcpy(reply, "Err - bad ack_every");
          return true;
        }
        if (ack_ul < 1 || ack_ul > 64) {
          OTA_DEBUG_PRINTLN("begin rejected: bad ack_every %lu", ack_ul);
          strcpy(reply, "Err - ack_every range 1..64");
          return true;
        }
        ack_every = (uint16_t) ack_ul;
        sub = skipSpaces(tok2_end);
      }

      if (*sub != 0) {
        OTA_DEBUG_PRINTLN("begin rejected: too many args");
        strcpy(reply, "Err - too many args");
        return true;
      }
    }

    if ((size_t) size_ul > nrf52OtaStageSize()) {
      OTA_DEBUG_PRINTLN("begin failed: stream larger than the staging area (%lu > %lu)",
                        size_ul, (unsigned long) nrf52OtaStageSize());
      strcpy(reply, "Err - image too big");
      return true;
    }

    _md5_ctx = malloc(sizeof(ota_md5_ctx));
    if (_md5_ctx == NULL) {
      OTA_DEBUG_PRINTLN("begin failed: no RAM for the hash context");
      strcpy(reply, "Err - no mem");
      return true;
    }
    ota_md5_init((ota_md5_ctx *) _md5_ctx);

    // Any previously armed update is superseded by this transfer. Clear it now
    // so an aborted transfer can never leave the old record pointing at a
    // staging area that is being overwritten underneath it.
    flash_nrf5x_flush();
    flash_nrf5x_erase(nrf52OtaRecordPage());

    _active = true;
    _stream_started = false;
    memcpy(_md5, md5, sizeof(_md5));
    _expected_size = (size_t) size_ul;
    _received_size = 0;
    _flashed_size = 0;
    _stage_base = 0;
    _stage_range_count = 0;
    _next_progress_log = OTA_PROGRESS_LOG_STEP_BYTES;
    _ack_every_chunks = ack_every;
    _chunks_since_ack = 0;
    OTA_DEBUG_PRINTLN("begin ok, size=%lu md5=%s ack_every=%u",
                      (unsigned long) _expected_size,
                      has_md5 ? md5 : "(none)",
                      (unsigned int) _ack_every_chunks);
    strcpy(reply, "OK - OTA begin");
    return true;
  }

  if (strncmp(sub, "write", 5) == 0 && (sub[5] == 0 || sub[5] == ' ')) {
    if (!_active) {
      OTA_DEBUG_PRINTLN("write rejected: not started");
      strcpy(reply, "Err - OTA not started");
      return true;
    }

    sub = skipSpaces(sub + 5);
    if (*sub == 0) {
      OTA_DEBUG_PRINTLN("write rejected: missing chunk");
      strcpy(reply, "Err - missing OTA chunk");
      return true;
    }

    const char *hex_start = sub;
    size_t expected_offset = _received_size;

    // optional format: ota write <offset> <hex>
    const char *sp = sub;
    while (*sp && *sp != ' ') {
      sp++;
    }
    if (*sp == ' ') {
      char *endptr = nullptr;
      unsigned long offset = strtoul(sub, &endptr, 10);
      if (endptr && endptr > sub && endptr == sp) {
        expected_offset = (size_t) offset;
        hex_start = skipSpaces(sp);
      }
    }

    size_t hex_len = strlen(hex_start);
    sub = hex_start;
    while (hex_len > 0 && sub[hex_len - 1] == ' ') {
      hex_len--;
    }
    if (hex_len == 0) {
      OTA_DEBUG_PRINTLN("write rejected: empty hex");
      strcpy(reply, "Err - missing OTA chunk");
      return true;
    }

    uint8_t chunk[OTA_CMD_MAX_CHUNK_BYTES];
    size_t chunk_len = 0;
    if (!decodeHex(sub, hex_len, chunk, sizeof(chunk), &chunk_len)) {
      OTA_DEBUG_PRINTLN("write rejected: bad hex");
      strcpy(reply, "Err - bad OTA hex");
      return true;
    }

    return writeChunk(expected_offset, chunk, chunk_len, reply);
  }

  if (strncmp(sub, "end", 3) == 0 && (sub[3] == 0 || sub[3] == ' ')) {
    if (!_active) {
      // 'end' costs several seconds here (the image is decompressed before
      // being armed), which is ample time for the reply to be lost and the
      // client to retry. Answering the retry with 'not started' would fail a
      // transfer that in fact succeeded, so a repeat of 'end' while an update
      // is already armed simply repeats the answer.
      if (_awaiting_reboot_since != 0) {
        OTA_DEBUG_PRINTLN("end repeated: image already staged");
        strcpy(reply, "OK - OTA staged, reboot now");
        return true;
      }
      OTA_DEBUG_PRINTLN("end rejected: not started");
      strcpy(reply, "Err - OTA not started");
      return true;
    }
    if (_received_size != _expected_size) {
      OTA_DEBUG_PRINTLN("end rejected: size mismatch %lu/%lu",
                        (unsigned long) _received_size,
                        (unsigned long) _expected_size);
      sprintf(reply, "Err - size mismatch (%lu/%lu)", (unsigned long)_received_size, (unsigned long)_expected_size);
      return true;
    }

