TheMalkavien/MeshCore/src/helpers/nrf52/NRF52OTA.cpp
    if (!flushStage(reply)) {
      return true;  // reply set by the failed flush
    }

    if (!_stream_started || _flashed_size != _expected_size) {
      OTA_DEBUG_PRINTLN("end rejected: %lu of %lu bytes reached flash",
                        (unsigned long) _flashed_size, (unsigned long) _expected_size);
      strcpy(reply, "Err - OTA not started");
      return true;
    }

    if (!armRecord(reply)) {
      clearState();
      return true;   // reply set by armRecord
    }

    OTA_DEBUG_PRINTLN("end ok, image staged");
    clearState();
    // Stay awake for the reboot command that follows (see NRF52_OTA_REBOOT_GRACE_MS).
    _awaiting_reboot_since = millis();
    if (_awaiting_reboot_since == 0) _awaiting_reboot_since = 1;   // 0 means 'not waiting'
    strcpy(reply, "OK - OTA staged, reboot now");
    return true;
  }

  OTA_DEBUG_PRINTLN("unknown command: %s", sub);
  strcpy(reply, "Err - unknown OTA cmd");
  return true;
}

bool NRF52OTAController::writeChunk(size_t offset, const uint8_t *chunk, size_t chunk_len, char reply[]) {
  if (!_active) {
    OTA_DEBUG_PRINTLN("write rejected: not started");
    strcpy(reply, "Err - OTA not started");
    return true;
  }
  if (chunk_len == 0) {
    OTA_DEBUG_PRINTLN("write rejected: empty chunk");
    strcpy(reply, "Err - empty OTA chunk");
    return true;
  }
  if (offset + chunk_len > _expected_size) {
    OTA_DEBUG_PRINTLN("write rejected: overflow");
    strcpy(reply, "Err - OTA overflow");
    return true;
  }

  bool was_contiguous = (offset == _received_size);

  if (_stage_size > 0) {
    // Out-of-order acceptance within the current staging block: the stage is
    // random-access RAM, so a chunk landing past a lost one is stored at its
    // place instead of being rejected (holes are advertised via 'miss=' in the
    // status reply). Data leaves the stage - towards the flash, which is
    // strictly sequential - only as complete blocks.
    const uint8_t *src = chunk;
    size_t off = offset;
    size_t remaining = chunk_len;
    bool consumed_any = false;

    while (remaining > 0) {
      if (off < _stage_base) {  // duplicate of already-flushed data: idempotent
        size_t skip = _stage_base - off;
        if (skip > remaining) skip = remaining;
        off += skip;
        src += skip;
        remaining -= skip;
        consumed_any = true;
        continue;
      }

      size_t extent = stageExtent();
      size_t win_end = _stage_base + extent;
      if (extent == 0 || off >= win_end) {
        if (!consumed_any) {
          OTA_DEBUG_PRINTLN("write rejected: bad offset %lu expected %lu",
                            (unsigned long) off, (unsigned long) _received_size);
          sprintf(reply, "Err - offset %lu expected %lu",
                  (unsigned long) off, (unsigned long) _received_size);
          return true;
        }
        OTA_DEBUG_PRINTLN("write tail dropped at %lu (window end %lu)",
                          (unsigned long) off, (unsigned long) win_end);
        break;
      }

      size_t n = win_end - off;
      if (n > remaining) n = remaining;
      size_t rel = off - _stage_base;
      if (!insertStageRange(rel, rel + n)) {
        // Range table full: degrade to sequential-only for this chunk.
        if (!consumed_any) {
          OTA_DEBUG_PRINTLN("write rejected: range table full at %lu (done %lu)",
                            (unsigned long) off, (unsigned long) _received_size);
          sprintf(reply, "Err - offset %lu expected %lu",
                  (unsigned long) off, (unsigned long) _received_size);
          return true;
        }
        break;
      }
      memcpy(_stage + rel, src, n);
      off += n;
      src += n;
      remaining -= n;
      consumed_any = true;

      _received_size = _stage_base + stagePrefix();
      if (stagePrefix() == extent && !flushStage(reply)) {
        return true;  // reply set by the failed flush
      }
    }
  } else {
    // No staging buffer (alloc failed): strict sequential mode.
    if (!was_contiguous) {
      OTA_DEBUG_PRINTLN("write rejected: bad offset %lu expected %lu",
                        (unsigned long) offset,
                        (unsigned long) _received_size);
      sprintf(reply, "Err - offset %lu expected %lu", (unsigned long) offset, (unsigned long) _received_size);
      return true;
    }
    if (!writePayload(chunk, chunk_len, reply)) {
      return true;
    }
    _received_size += chunk_len;
  }

  if (_received_size >= _next_progress_log || _received_size == _expected_size) {
    OTA_DEBUG_PRINTLN("progress %lu/%lu",
                      (unsigned long) _received_size,
                      (unsigned long) _expected_size);
    _next_progress_log = _received_size + OTA_PROGRESS_LOG_STEP_BYTES;
  }

  if (!was_contiguous) {
    // Accepted into the block, but not contiguous: reply the legacy offset
    // error so rewind-based clients resync as they always did (suppressed in
    // binary transport, where recovery is 'miss='-driven instead).
    sprintf(reply, "Err - offset %lu expected %lu",
            (unsigned long) offset, (unsigned long) _received_size);
    return true;
  }

  _chunks_since_ack++;

  bool should_ack_now = (_ack_every_chunks <= 1)
                     || (_chunks_since_ack >= _ack_every_chunks)
                     || (_received_size == _expected_size);
  if (should_ack_now) {
    _chunks_since_ack = 0;
    strcpy(reply, "OK");
  } else {
    reply[0] = 0;  // suppress intermediate ack to reduce return traffic
  }
  return true;
}

// Append the next slice of the stream to the staging area. Strictly
// sequential: _flashed_size is the write cursor.
bool NRF52OTAController::writePayload(const uint8_t *data, size_t len, char reply[]) {
  if (!_stream_started) {
    // The applier can only deal with gzip, and the size budget assumes it: a
    // raw image the size of the running firmware does not fit in staging.
    if (len < 2 || data[0] != 0x1f || data[1] != 0x8b) {
      OTA_DEBUG_PRINTLN("write rejected: not a gzip stream");
      strcpy(reply, "Err - gzip image required");
      clearState();
      return false;
    }
    _stream_started = true;
  }

  if (_flashed_size + len > nrf52OtaStageSize()) {
    OTA_DEBUG_PRINTLN("write failed: staging area overflow at %lu",
                      (unsigned long) _flashed_size);
    strcpy(reply, "Err - staging overflow");
    clearState();
    return false;
  }

  ota_md5_update((ota_md5_ctx *) _md5_ctx, data, len);

  if (flash_nrf5x_write(nrf52OtaStageStart() + _flashed_size, data, len) < 0) {
    OTA_DEBUG_PRINTLN("write failed: flash error at %lu", (unsigned long) _flashed_size);
    strcpy(reply, "Err - flash write failed");
    clearState();
    return false;
  }
  _flashed_size += len;
  return true;
}

