TheMalkavien/MeshCore/src/helpers/nrf52/NRF52OTA.cpp
bool NRF52OTAController::flushStage(char reply[]) {
  size_t extent = stageExtent();
  if (extent == 0 || stagePrefix() < extent) {
    return true;  // block incomplete (holes or nothing staged): nothing to flush
  }
  if (!writePayload(_stage, extent, reply)) {
    return false;  // fatal, state cleared by writePayload
  }
  _stage_base += extent;
  _stage_range_count = 0;
  _received_size = _stage_base;
  return true;
}

bool NRF52OTAController::handleBinaryCommand(uint8_t opcode, const uint8_t *payload, size_t payload_len, char reply[]) {
  if (reply == NULL) {
    return false;
  }

  if (payload == NULL && payload_len > 0) {
    strcpy(reply, "Err - bad payload");
    return true;
  }

  expireIfIdle();
  if (_armed || _active) {
    _last_activity_millis = millis();
  }

  switch (opcode) {
    case BIN_OP_START:
      return startSession("binary", reply);

    case BIN_OP_BEGIN: {
      if (payload_len < 5) {
        strcpy(reply, "Err - bad begin payload");
        return true;
      }

      uint32_t size = (uint32_t) payload[0]
                    | ((uint32_t) payload[1] << 8)
                    | ((uint32_t) payload[2] << 16)
                    | ((uint32_t) payload[3] << 24);
      uint8_t ack_every = payload[4];
      if (ack_every < 1 || ack_every > 64) {
        strcpy(reply, "Err - ack_every range 1..64");
        return true;
      }

      if (payload_len >= 21) {
        char md5_hex[33];
        bytesToHex(&payload[5], 16, md5_hex);

        char cmd[96];
        snprintf(cmd, sizeof(cmd), "begin %lu %s %u",
                 (unsigned long) size, md5_hex, (unsigned int) ack_every);
        return handleCommand(cmd, reply);
      }

      char cmd[48];
      snprintf(cmd, sizeof(cmd), "begin %lu %u",
               (unsigned long) size, (unsigned int) ack_every);
      return handleCommand(cmd, reply);
    }

    case BIN_OP_WRITE: {
      // Binary write payload layout:
      //   <offset:u32 little-endian><chunk_len:u8><chunk_bytes...>
      bool ok = true;
      if (payload_len >= 6) {
        uint32_t offset = (uint32_t) payload[0]
                        | ((uint32_t) payload[1] << 8)
                        | ((uint32_t) payload[2] << 16)
                        | ((uint32_t) payload[3] << 24);
        uint8_t declared_len = payload[4];
        if (declared_len >= 1 && declared_len <= OTA_CMD_MAX_CHUNK_BYTES
            && payload_len >= (size_t)(5 + declared_len)) {
          ok = writeChunk((size_t) offset, &payload[5], declared_len, reply);
        }
      }
      // Binary transport: suppress EVERY per-write reply. The radio is
      // half-duplex, so replying mid-batch blinds the receiver while the client
      // is still streaming. Progress and resync go through BIN_OP_STATUS.
      reply[0] = 0;
      return ok;
    }

    case BIN_OP_END:
      return handleCommand("end", reply);

    case BIN_OP_STATUS:
      return handleCommand("status", reply);

    case BIN_OP_ABORT:
      return handleCommand("abort", reply);

    default:
      strcpy(reply, "Err - unknown OTA bin cmd");
      return true;
  }
}

#endif
